DSIII/agenda4/favorite-movies/app/Controllers/Filmes.php

SELECT COUNT(*) AS `numrows` FROM `films`
INSERT INTO `films` (`categories`, `imageUrl`, `movieTitle`, `rating`, `releaseYear`, `watched`)
VALUES ('Drama','https://www.themoviedb.org/t/p/w600_and_h900_bestv2/umX3lBhHoTV7Lsci140Yr8VpXyN.jpg','Um sonho de liberdade',4,1994,0), ('Sci-Fi, Ação','https://www.themoviedb.org/t/p/w600_and_h900_bestv2/l5uPlrjcVSI3z3duYeyRAP2E2D0.jpg','Exterminador do Futuro 2',5,1991,0)
---
        // ];

        // Verifica se a tabela está vazia antes de inserir
        if ($this->filmModel->countAll() == 0) {
            $this->filmModel->insertBatch([
                [

                    'movieTitle' => 'Um sonho de liberdade',
                    'rating' => 4,
                    'releaseYear' => 1994,
                    'imageUrl' => 'https://www.themoviedb.org/t/p/w600_and_h900_bestv2/umX3lBhHoTV7Lsci140Yr8VpXyN.jpg',
                    'categories' => 'Drama',
                    'watched' => false
                ],
                [

                    'movieTitle' => 'Exterminador do Futuro 2',
                    'rating' => 5,
                    'releaseYear' => 1991,
                    'imageUrl' => 'https://www.themoviedb.org/t/p/w600_and_h900_bestv2/l5uPlrjcVSI3z3duYeyRAP2E2D0.jpg',
                    'categories' => 'Sci-Fi, Ação',
                    'watched' => false
                ],
            ]);

SELECT *
FROM `films`
---


        // Busca todos os filmes do banco de dados
        $movies = $this->filmModel->findAll();